icf1/bubble_migration/bubble_migration/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   staticFvMesh; //dynamicMultiDimRefineBalancedFvMesh; //dynamicMultiDimRefineFvMesh

enableBalancing true;
allowableImbalance 0.10;

adaptCriteria
{
    // type fieldBounds;
    // fieldName alpha.liquid;
    // lowerBound 0.001;
    // upperBound 0.999;

    type composedAdaptCriteria;
    operation or;
    criteria
    (
        interface
        {
            type fieldBounds;
            fieldName alpha.liquid;
            lowerBound 0.0001;
            upperBound 0.9999;
            nLayer     2;
        }
        fluid
        {
            type fieldBounds;
            fieldName alpha.liquid;
            lowerBound 0.0001;
            upperBound 2;
            maxCellLevel 1;
        }
    );
}
// How often to refine
refineInterval  5;


// Have slower than 2:1 refinement
nBufferLayers   1;

// Refine cells only up to maxRefinement levels
maxRefinement   1;

// Stop refinement if maxCells reached
maxCells        1500000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi none)
    (nHatf none)
    (rhoPhi none)
    (alphaPhi0.liquid none)
    (alphaPhi0 none)
    (alphaPhiUn none)
    (ghf none)
    (phi0 none)
    (dVf_ none)
);

// Write the refinement level as a volScalarField
dumpLevel       true;





// ************************************************************************* //
