icf1/bubble_migration/bubble_migration/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

//These vertices define the block below. It envelopes the stl files. The block can be even bigger than the stl files
//Watch out if the stl files are created in mm or m!

xmin 0;
xmax 12;
ymin 0;
ymax 40;
zmin 0;
zmax 128;

// xcells 15;  //
// ycells 50;  // 
// zcells 160; //

xcells 7;  //
ycells 25;  // 
zcells 80; //

vertices
(
    (0 0 0.165363)
    (0.805068 0 0.165363)
    (10.71797 36.93937 2.201493)
    (0 36.93937 2.201493)
    (0 0 127.3581)
    (0.811976 0 127.3581)
    (6.973493 22.96024 128.6237)
    (0 22.96024 128.6237)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    tank		//Adjust these settings according to symmetry patches. Currently none invoked
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 3 2 1)
	        (4 5 6 7)
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    symm_side		//Adjust these settings according to symmetry patches. Currently none invoked
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
        );
    }
);

// ************************************************************************* //
