icf1/bubble_migration/bubble_migration/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam; // interFlow works with VoFLibrary

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         440;

deltaT          1E-10;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDeltaT       1;
maxCapillaryNum 0.5;

libs    (impFunctionEllipsoid);

functions
{
    surfacesVTP
    {
        type            surfaces;
        libs            (geometricVoF sampling);
        writeControl    writeTime;

        surfaceFormat   vtp;
        fields          (p U);

        interpolationScheme cell;

        surfaces
        {
            freeSurf
            {
                type            isoSurface;
                isoValue        0.5;
                isoField        alpha.liquid;
                interpolate     false;
            }
        }
    }

    surfaceData
    {
        type            surfaces;
        libs            (sampling);
        writeControl    writeTime;

        surfaceFormat   raw;
        fields          (p U);

        interpolationScheme cell;

        surfaces
        {
            freeSurf
            {
                type            isoSurface;
                isoValue        0.5;
                isoField        alpha.liquid;
                interpolate     false;
            }
        }
    }
}

// ************************************************************************* //
