icf1/bubble_migration/bubble_migration/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "constant/triSurface/tank.fms";

maxCellSize 2;

boundaryCellSize 0.5;

// objectRefinements
// {
    // ear1
    // {
    //     type        cone;
    //     cellSize    10;
    //     p0          (-100 1873 -320);
    //     radius0     200;
    //     p1          (-560 1400 0);
    //     radius1     200;
    // }
//     ear2
//     {
//         type        cone;
//         cellSize    10;
//         p0          (-650 1873 -620);
//         radius0     200;
//         p1          (-670 1300 0);
//         radius1     200;
//     }
    // tail
    // {
    //     type        box;
    //     cellSize    0.5;
    //     centre      (0 0 2);
    //     lengthX     100;
    //     lengthY     4;
    //     lengthZ     200;
    // }
//     insideTheBody
//     {
//         type        sphere;
//         cellSize    10;
//         centre      (0 700 0);
//         radius      50;
//     }
//     muzzlePiercing
//     {
//         type        line;
//         cellSize    10;
//         p0          (-750 1000 450);
//         p1          (-750 1500 450);
//     }
// }

meshQualitySettings
{
    // maxNonOrthogonality 30;

    // minTetQuality       1e-10;
}

// ************************************************************************* //