icf1/bubble_migration/bubble_migration/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid 1//only liquid in the domain
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (-0.015 0.012 0.075) (0.015 0.025 0.13);
        fieldValues
        (
            volScalarFieldValue alpha.liquid 0//we set our block of air into the domain
        );
    }
 );


// ************************************************************************* //
